{
  "name": "schools_ex",
  "plugins": [
    {
      "name": "Ant Design",
      "description": "A design system for enterprise-level products. Create an efficient and enjoyable work experience.",
      "url": "https://ant.design/docs/react/introduce"
    },
    {
      "name": "SASS/SCSS",
      "description": "Sass is a stylesheet language that’s compiled to CSS. It allows you to use variables, nested rules, mixins, functions, and more, all with a fully CSS-compatible syntax.",
      "url": "https://sass-lang.com/documentation"
    },
    {
      "name": "React Redux",
      "description": "Redux helps you write applications that behave consistently, run in different environments (client, server, and native), and are easy to test.",
      "url": "https://redux.js.org/introduction/getting-started"
    },
    {
      "name": "RTK Query",
      "description": "RTK Query is a powerful data fetching and caching tool",
      "url": "https://redux-toolkit.js.org/rtk-query/overview"
    },
    {
      "name": "next-i18next",
      "description": "next-i18next is a plugin for Next.js projects that allows you to get translations up and running quickly and easily, while fully supporting SSR, multiple namespaces with codesplitting, etc.",
      "url": "https://github.com/isaachinman/next-i18next"
    },
    {
      "name": "Testing Library",
      "description": "The React Testing Library is a very light-weight solution for testing React components. It provides light utility functions on top of react-dom and react-dom/test-utils.",
      "url": "https://testing-library.com/docs/"
    },
    {
      "name": "Cypress",
      "description": "Fast, easy and reliable testing for anything that runs in a browser.",
      "url": "https://docs.cypress.io/guides/overview/why-cypress.html"
    },
    {
      "name": "Docker",
      "description": "Docker simplifies and accelerates your workflow, while giving developers the freedom to innovate with their choice of tools, application stacks, and deployment environments for each project.",
      "url": "https://www.docker.com/get-started"
    },
    {
      "name": "Github Actions",
      "description": "GitHub Actions makes it easy to automate all your software workflows, now with world-class CI/CD. Build, test, and deploy your code right from GitHub.",
      "url": "https://docs.github.com/en/actions"
    }
  ]
}
